Revit 2024 API
ParameterTypeId.FabricationFittingDescription Property
 "Fabrication Fitting Description"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FabricationFittingDescription { get; }
Visual Basic
Public Shared ReadOnly Property FabricationFittingDescription As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FabricationFittingDescription {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace